src/test/resources/xml/SetParameterValues.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<cwmp:ID xmlns:cwmp="urn:dslforum-org:cwmp-1-0"
			soapenv:mustUnderstand="1" xsi:type="xsd:string">1234</cwmp:ID>
		<cwmp:NoMoreRequests xmlns:cwmp="urn:dslforum-org:cwmp-1-0"
			soapenv:mustUnderstand="0" xsi:type="xsd:string">0</cwmp:NoMoreRequests>
	</soapenv:Header>
	<soapenv:Body>
		<cwmp:SetParameterValues xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
			<ParameterList>
				<ParameterValueStruct>
					<Name xsi:type="xsd:string">
						InternetGatewayDevice.ManagementServer.Username
			</Name>
					<Value xsi:type="xsd:string">olivier</Value>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name xsi:type="xsd:string">
						InternetGatewayDevice.ManagementServer.Password
			</Name>
					<Value xsi:type="xsd:string">petit pois</Value>
				</ParameterValueStruct>
			</ParameterList>
			<ParameterKey xsi:type="xsd:string">test</ParameterKey>
		</cwmp:SetParameterValues>
	</soapenv:Body>
</soapenv:Envelope>